<?php

require_once ("./math_model/ad_model.php");
?>
<form method="POST">
    <br>
    <span>Введіть всі потрібні параметри</span>
    <input class="text" type="text" name="x" placeholder= "x" size="5" required>
    <br>
    <?php
//ТРЕБА ІНПУТИ ДЛЯ ТАКИХ ЗНАЧЕНЬ
//ВАЛІДАЦІЯ ЗНАЧЕНЬ

$N0 = 172199;    //максимальна кількість покупців
$alpha1 = 0.07;   //інтенсивність реклами
$alpha2 = 0.02;  //ступінь спілкування клієнтів з іншими людьми позначимо
$p = 300;      //величина прибутку від продажу одиниці товару
$s = 50000;      //вартість (ціна) елементарного акту реклами
$k = 0.01;      //коефіцієнт пропорційності
$alpha_opt = 0.03;
$alpha22 = 0.01;

//ПЕРЕВЕДЕННЯ ЗНАЧЕНЬ У ПОТРІБНИЙ ВИД - МАШТАБУВАННЯ
//ЗАКИДУЄМО У БД
//ПЕРЕВІРКА УМОВИ ДОЦІЛЬНОСТІ РЕКЛАМИ

//ВИКЛИК ФУНКЦІЙ ОБРАХУНКУ
//ФУНКЦІЇ ПОВЕРНУТЬ МАСИВИ
//ВИВЕСТИ ГРАФІК
